app/controllers/home_controller.rb

SELECT "makes".* FROM "makes"
SELECT COUNT(*) FROM "makes"
---
  def index
    unless Setting.is_first_load?
      print("aaaaaaaabbbb")
      Make.get_make_info
    end

    @makes = Make.all
    print(@makes.count)