app/controllers/models_controller.rb

  def index
    @make = Make.where(webmotors_id: params[:webmotors_make_id])[0]
    @models = Model.where(make_id: @make.id)
---
SELECT "makes".* FROM "makes" WHERE "makes"."webmotors_id" = ?  [["webmotors_id", 17]]
SELECT "models".* FROM "models" WHERE "models"."make_id" = ?  [["make_id", 6]]